In [1]:
import pandas as pd
import numpy as np

#### Q1 : Find all unique employee names who works in more than one department

In [2]:
df = pd.DataFrame({'EmployeeName':['John Doe','John Smith','Alice Johnson','John Doe'],'Department':['Sales','Marketing','Sales','Marketing']})

In [3]:
df = df.groupby('EmployeeName').size().reset_index(name='count')
# Filter the dataframe to only include employees who work in more than one department
df = df[df['count'] > 1]

In [4]:
unique_employee_name = df['EmployeeName'].unique()
print(unique_employee_name)

['John Doe']

In [5]:
# 2nd method
df_emp = pd.DataFrame({'EmployeeName':['John Doe','John Smith','Alice Johnson','John Doe'],'Department':['Sales','Marketing','Sales','Marketing']})

df_emp = df_emp.groupby('EmployeeName')['Department'].nunique()

unique_emp = df_emp[df_emp>1].index.tolist()

print(unique_emp)

['John Doe']

#### Q2 : Calculate the monthly average sales for each product, Assume sales data is daily

In [6]:
data = pd.DataFrame({'Date':pd.date_range(start='2023-01-01',end='2023-03-31'),'Product':np.random.choice(['ProductA','ProductB'],90),'Sales':np.random.randint(100,500,90)})

In [7]:
data['Month']=data['Date'].dt.month

In [8]:
month_avg_sales = data.groupby(['Product','Month'])['Sales'].mean()
print(month_avg_sales)

Product   Month
ProductA  1        328.357143
          2        356.866667
          3        324.705882
ProductB  1        329.647059
          2        237.538462
          3        310.071429
Name: Sales, dtype: float64

#### Q3 : Identify the top 3 employees with the highest sales in each quarter

In [9]:
emp = pd.DataFrame({'Employee':['John', 'Jane', 'Doe', 'Smith', 'Alice'],'Quarter':['Q1', 'Q1', 'Q2', 'Q2', 'Q3'],'Sales': [200, 150, 300, 250, 400]})

In [10]:
additional_data = pd.DataFrame({
    'Employee': ['Bob', 'Emily', 'Charlie', 'Ella', 'David'],
    'Quarter': ['Q1', 'Q1', 'Q2', 'Q2', 'Q3'],
    'Sales': [180, 220, 280, 210, 350]
})

In [11]:
emp = pd.concat([emp,additional_data],ignore_index = True)

In [12]:
#it will extract top sales from each QTR
emp.groupby('Quarter')['Sales'].max()

Quarter
Q1    220
Q2    300
Q3    400
Name: Sales, dtype: int64

In [13]:
emp = emp.groupby('Quarter').apply(lambda x:x.nlargest(3,'Sales')).reset_index(drop=True)
print(emp)

  Employee Quarter  Sales
0    Emily      Q1    220
1     John      Q1    200
2      Bob      Q1    180
3      Doe      Q2    300
4  Charlie      Q2    280
5    Smith      Q2    250
6    Alice      Q3    400
7    David      Q3    350

In [14]:
#2nd method

emp_sorted = emp.sort_values(by=['Quarter','Sales'],ascending =[True,False])

top_3_emp = emp_sorted.groupby('Quarter').head(3).reset_index(drop=True)

In [15]:
print(top_3_emp)

  Employee Quarter  Sales
0    Emily      Q1    220
1     John      Q1    200
2      Bob      Q1    180
3      Doe      Q2    300
4  Charlie      Q2    280
5    Smith      Q2    250
6    Alice      Q3    400
7    David      Q3    350

#### Q4 : Analyze the attendance records to find employees with more than 95% attendance throughout the year

In [16]:
att_record = pd.DataFrame({'Employee':['John','Jane','Doe','charlie'],'TotalDays':[365,365,365,365],'DaysAttended':[365,350,360,100]})
# Selecting rows based on condition
top_employee = att_record.loc[att_record['DaysAttended']/att_record['TotalDays']>0.95,['Employee','DaysAttended']]

print(top_employee)

  Employee  DaysAttended
0     John           365
1     Jane           350
2      Doe           360

#### Q5 : Calculate the monthly customer retention rate based on the transaction logs.

In [17]:
customer = pd.DataFrame({'Month':['Jan','Feb','Mar','Jan','Feb','Mar'],'CustomerID':[1,1,1,2,2,3],'TransactionCount':[1,2,1,3,2,1]})

In [18]:
monthly_customers = customer.groupby('Month')['CustomerID'].nunique()

In [19]:
monthly_customers

Month
Feb    2
Jan    2
Mar    2
Name: CustomerID, dtype: int64

In [20]:
# Calculate the retention rate

retention_rate = monthly_customers/monthly_customers.shift(1)

In [21]:
retention_rate = retention_rate.dropna()

print("Monthly Customer Retention Rate:")
print(retention_rate)

Monthly Customer Retention Rate:
Month
Jan    1.0
Mar    1.0
Name: CustomerID, dtype: float64

In [22]:
customer

  Month  CustomerID  TransactionCount
0   Jan           1                 1
1   Feb           1                 2
2   Mar           1                 1
3   Jan           2                 3
4   Feb           2                 2
5   Mar           3                 1

#### Q6 : Determine the average time employees spent on projects, assuming you have start and end dates for each project participation.

In [23]:
project=pd.DataFrame({'Employee': ['John', 'Jane', 'Doe'], 'ProjectStart': pd.to_datetime(['2023-01-01', '2023-02-15', '2023-03-01']), 'ProjectEnd': pd.to_datetime(['2023-01-31', '2023-03-15', '2023-04-01'])})

In [24]:
project['Duration'] = (project['ProjectEnd']-project['ProjectStart']).dt.days

avg_time = project['Duration'].mean()
print(avg_time)

29.666666666666668

#### Q7 : Compute the month-on-month growth rate in sales for each product, highlighting products with more than 10% growth for consecutive months.

In [25]:
sales = pd.DataFrame({'Month': ['Jan', 'Feb', 'Mar', 'Jan', 'Feb', 'Mar'], 'Product': ['A', 'A', 'A', 'B', 'B', 'B'], 'Sales': [200, 220, 240, 150, 165, 180]})

In [26]:
#convert months to number

month_number = {'Jan':1,'Feb':2,'Mar':3}
sales['Month_number'] = sales['Month'].map(month_number)

sales

  Month Product  Sales  Month_number
0   Jan       A    200             1
1   Feb       A    220             2
2   Mar       A    240             3
3   Jan       B    150             1
4   Feb       B    165             2
5   Mar       B    180             3

In [27]:
# Sort dataframe by 'Product' and 'month_number' to ensure sequnetial months for each product

sales = sales.sort_values(by=['Product','Month_number'])
sales

  Month Product  Sales  Month_number
0   Jan       A    200             1
1   Feb       A    220             2
2   Mar       A    240             3
3   Jan       B    150             1
4   Feb       B    165             2
5   Mar       B    180             3

In [28]:
# calculate growth rate 
sales['growth_rate'] = sales.groupby('Product')['Sales'].pct_change()
sales['growth_rate']

0         NaN
1    0.100000
2    0.090909
3         NaN
4    0.100000
5    0.090909
Name: growth_rate, dtype: float64

In [29]:
# identify product with more than 10% growth for consective months

consecutive_growth = sales[(sales['growth_rate']>0.10) & (sales['growth_rate'].shift(-1)>0.10)]
print(consecutive_growth)

Empty DataFrame
Columns: [Month, Product, Sales, Month_number, growth_rate]
Index: []

#### Q8 :Identify the time of day (morning, afternoon, evening) when sales peak for each category of products.

In [30]:
sales = pd.DataFrame({'Category': ['Electronics', 'Clothing', 'Electronics', 'Clothing'], 'TimeOfDay': ['Morning', 'Afternoon', 'Evening', 'Morning'], 'Sales': [300, 150, 500, 200]})

In [31]:
sales_peakTime = sales.loc[sales.groupby('Category')['Sales'].idxmax(),['Category','TimeOfDay']]
sales_peakTime

#within each group, we find the index of the row with the maximum sales value using idxmax()

      Category TimeOfDay
3     Clothing   Morning
2  Electronics   Evening

#### Q9. Calculate the profit margin for each product category based on revenue and cost data.

In [32]:
df = pd.DataFrame({'Category': ['Electronics', 'Clothing'],
                   'Revenue': [1000, 500],
                   'Cost': [700, 300]})

In [33]:
df['ProfitMargin'] = ((df['Revenue'] - df['Cost']) / df['Revenue']) * 100

print(df)

      Category  Revenue  Cost  ProfitMargin
0  Electronics     1000   700          30.0
1     Clothing      500   300          40.0